DataProcessors/фин_КонтрольПрогнозныхТранзакций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>фин_КонтрольПрогнозныхТранзакций</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сценарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СценарииПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокРазрезовКонтроля</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокПолейСНесколькимиЗначениями</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьУказанныйКурс</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кратность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрНакопления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРегистра</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзмерениеРегистраДокумент</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>БюджетныеОперации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФинансовыйПоказатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.фин_ФинансовыеПоказатели</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УправленческоеПодразделение</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.фин_СправочникУправленческихПодразделений</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Проект</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.фин_СправочникПроектов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.фин_СправочникиНоменклатурныхСписков</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Разрез1</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.фин_ВидыСубконтоБюджетирования</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Разрез10</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.фин_ВидыСубконтоБюджетирования</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Разрез2</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.фин_ВидыСубконтоБюджетирования</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Разрез3</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.фин_ВидыСубконтоБюджетирования</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Разрез4</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.фин_ВидыСубконтоБюджетирования</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Разрез5</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.фин_ВидыСубконтоБюджетирования</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Разрез6</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.фин_ВидыСубконтоБюджетирования</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Разрез7</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.фин_ВидыСубконтоБюджетирования</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Разрез8</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.фин_ВидыСубконтоБюджетирования</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Разрез9</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.фин_ВидыСубконтоБюджетирования</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДополнительныеРазрезы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.фин_КлассификаторНаборовДополнительныхРазрезов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СценарииКонтроля</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сценарий</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СценарииПланирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Enums/фин_ФактическиеПоказателиБюджетирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>фин_ФактическиеПоказателиБюджетирования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ФинансовыйПоказатель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправленческоеПодразделение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Проект</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Контрагент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Номенклатура</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сумма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Количество</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Валюта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Организация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Разрез1</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Разрез2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Разрез3</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Разрез4</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Разрез5</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Разрез6</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Разрез7</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Разрез8</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Разрез9</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Разрез10</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сценарий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПериодПланирования</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/фин_КонтрольПрогнозныхТранзакций/Forms/Форма/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Параметры.Свойство("Документ",Объект.Документ);
	Если НЕ Параметры.Свойство("Организация",Объект.Организация) И ЗначениеЗаполнено(Объект.Документ) Тогда
		Объект.Организация = Объект.Документ.Организация;
	КонецЕсли;
	Если НЕ Параметры.Свойство("Дата",Объект.Дата) И ЗначениеЗаполнено(Объект.Документ) Тогда
		Объект.Дата = Объект.Документ.Дата;
	КонецЕсли;
	Параметры.Свойство("Сценарий",Объект.Сценарий);
	Если Параметры.Свойство("АдресДанных") Тогда
		Объект.БюджетныеОперации.Загрузить(ПолучитьИзВременногоХранилища(Параметры.АдресДанных));
	ИначеЕсли ЗначениеЗаполнено(Объект.Документ) Тогда
	
		Обработки.фин_КонтрольПрогнозныхТранзакций.ИнициализироватьДанныеДокумента(Объект);

	КонецЕсли;
	Обработки.фин_КонтрольПрогнозныхТранзакций.ИнициализироватьДанныеОбработки(Объект);
	
	ПодготовитьФормуНаСервере();
	
	ОбновитьДанныеКонтроля();
	
КонецПроцедуры




////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ ДеревоБюджетныйКонтроль

&НаКлиенте
Процедура АктуальныйМониторингПриИзменении(Элемент)
	
	ОбновитьДанныеКонтроля();
	
	Для Каждого СтрокаДерева Из ДеревоБюджетныйКонтроль.ПолучитьЭлементы() Цикл
		Элементы.ДеревоБюджетныйКонтроль.Развернуть(СтрокаДерева.ПолучитьИдентификатор(),Истина);	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоБюджетныйКонтрольКИсполнениюПоПрочимЗаявкамОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Идентификатор = Элементы.ДеревоБюджетныйКонтроль.ТекущиеДанные.Идентификатор;
	Валюта = Элементы.ДеревоБюджетныйКонтроль.ТекущиеДанные.Валюта;
	Период = Элементы.ДеревоБюджетныйКонтроль.ТекущиеДанные.Период;
	
	Попытка
		ТабличныйДокумент = ТаблицаРасшифровки(Идентификатор,Валюта,Период);
		Если ТабличныйДокумент <> Неопределено Тогда
			ТабличныйДокумент.Защита = Истина;
			ТабличныйДокумент.ТолькоПросмотр = Истина;
			ТабличныйДокумент.Показать("Прочие заявки");
		КонецЕсли;
	Исключение
		ТекстОшибки = ОписаниеОшибки();
		Если Найти(ТекстОшибки,"недостаточно прав") <> 0 Тогда
			ПоказатьПредупреждение(, НСтр("ru = 'Недостаточно прав для выполнения расшифровки!'"));
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'При расшифровке возникла ошибка: '" + ТекстОшибки));
		КонецЕсли;
	КонецПопытки;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ОбновитьБюджетныйКонтроль(Команда) Экспорт
	
	ОбновитьДанныеКонтроля();
	
	Для Каждого СтрокаДерева Из ДеревоБюджетныйКонтроль.ПолучитьЭлементы() Цикл
		Элементы.ДеревоБюджетныйКонтроль.Развернуть(СтрокаДерева.ПолучитьИдентификатор(),Истина);	
	КонецЦикла;
	
КонецПроцедуры


&НаСервере
Процедура ПодготовитьФормуНаСервере()
	
	
	Обработки.фин_КонтрольПрогнозныхТранзакций.ИнициализироватьДанныеРазрезов(Объект);
	
	ВалютаРегламентированногоУчета 		= фин_ОбщегоНазначенияВызовСервераПовтИсп.ЗначениеПеременной("ВалютаРегламентированногоУчета");
	ВалютаУправленческогоУчета 			= фин_ОбщегоНазначенияВызовСервераПовтИсп.ЗначениеПеременной("ВалютаУправленческогоУчета");
	фин_БюджетированиеОбщегоНазначения.НастроитьОформлениеТабличногоПоля(Элементы.ДеревоБюджетныйКонтроль);
		
	Элементы.ДеревоБюджетныйКонтрольСценарий.Видимость = Объект.СценарииКонтроля.Количество()>1;
	
	//фин_РаботаСДополнительнымиРазрезамиБюджетирования.НастроитьПредставлениеРазрезов(ЭтаФорма,,"БюджетныеПараметры",Ложь);
	НастроитьРазрезыБюджета(фин_ОбщегоНазначенияВызовСервераПовтИсп.ЗначениеПеременной("ПолучитьПолныйСписокРазрезов"));
	
	ИмяРазреза = "ФинансовыйПоказатель";
	Элементы["ДеревоБюджетныйКонтроль"+ИмяРазреза].Видимость = Объект.СписокПолейСНесколькимиЗначениями.НайтиПоЗначению(ИмяРазреза)<>Неопределено;
	
	ИмяРазреза = "Период";
	Элементы["ДеревоБюджетныйКонтроль"+ИмяРазреза].Видимость = Объект.СписокПолейСНесколькимиЗначениями.НайтиПоЗначению(ИмяРазреза)<>Неопределено;
	
	ИмяРазреза = "Валюта";
	Элементы["ДеревоБюджетныйКонтроль"+ИмяРазреза].Видимость = Объект.СписокПолейСНесколькимиЗначениями.НайтиПоЗначению(ИмяРазреза)<>Неопределено;
	
	Элементы.ДеревоБюджетныйКонтрольКИсполнениюПоТекущейСтрокеЗаявки.Видимость = Объект.БюджетныеОперации.Количество()>1;
	
	Если Объект.РегистрНакопления="" Тогда
		Элементы.ДеревоБюджетныйКонтрольКИсполнениюПоПрочимЗаявкам.Видимость=Ложь;
	КонецЕсли;
	
КонецПроцедуры 

//настраивает дополнительные разрезы
//
&НаСервере
Процедура НастроитьРазрезыБюджета(ПереченьРазрезов)
	ОбработанныеРазрезы=Новый Массив;
	Для Каждого Разрез Из ПереченьРазрезов Цикл
		ИмяРазреза = фин_ОбщегоНазначенияВызовСервераПовтИсп.ИмяРазреза(Разрез.Значение);
		
		Элементы["ДеревоБюджетныйКонтроль"+ИмяРазреза].Видимость = Объект.СписокПолейСНесколькимиЗначениями.НайтиПоЗначению(ИмяРазреза)<>Неопределено;
		
		Если Найти(ИмяРазреза,"Разрез")=0 Тогда
			Продолжить;
		КонецЕсли;
		НомерРазреза = Сред(ИмяРазреза,СтрДлина("Разрез")+1);
		Элементы["ДеревоБюджетныйКонтрольРазрез"+НомерРазреза].Заголовок = фин_ОбщегоНазначенияВызовСервераПовтИсп.ПредставлениеРазреза(Разрез.Значение);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеКонтроля()
	
	// подготовка данных для расчета
	ТаблицаБюджетныйКонтроль = ДанныеФормыВЗначение(ДеревоБюджетныйКонтроль, Тип("ДеревоЗначений"));
	СоответствиеРасшифровка = Новый Соответствие;
	
	Обработки.фин_КонтрольПрогнозныхТранзакций.ЗаполнитьБюджетныйКонтроль(Объект,ТаблицаБюджетныйКонтроль,СоответствиеРасшифровка,АктуальныйМониторинг);	
		
	ЗначениеВДанныеФормы(ТаблицаБюджетныйКонтроль,ДеревоБюджетныйКонтроль);
	
	АдресРасшифровок = ПоместитьВоВременноеХранилище(СоответствиеРасшифровка, УникальныйИдентификатор);
	
	Обновлено = ТекущаяДата();
	
КонецПроцедуры



&НаСервере
Функция ТаблицаРасшифровки(Идентификатор, Валюта,Период)
	
	СтрокаКонтроля = ДеревоБюджетныйКонтроль.НайтиПоИдентификатору(Идентификатор);
	
	СоответствиеРасшифровка = ПолучитьИзВременногоХранилища(АдресРасшифровок);
	СписокЗаявок = СоответствиеРасшифровка.Получить(Идентификатор);
	Если СписокЗаявок <> Неопределено И СписокЗаявок.Количество() > 0 Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаявкиОстатки."+Объект.ИзмерениеРегистраДокумент+" КАК Заявка,
		|	ЗаявкиОстатки.СуммаУпр"+?(Объект.ВидРегистра="Остатки","Остаток","Оборот")+" КАК Сумма,
		|	ЗаявкиОстатки.ВалютнаяСумма"+?(Объект.ВидРегистра="Остатки","Остаток","Оборот")+" КАК СуммаЗаявки
		|ИЗ
		|	РегистрНакопления."+Объект.РегистрНакопления+"."+Объект.ВидРегистра+"("+?(АктуальныйМониторинг=0 ИЛИ Объект.РегистрНакопления="фин_ПрогнозИсполненияБюджетов","","&Дата")+", "+?(Объект.ВидРегистра="Остатки","",",,")+Объект.ИзмерениеРегистраДокумент+" В (&Ссылка)) КАК ЗаявкиОстатки";
		
		Запрос.УстановитьПараметр("Дата", ?(АктуальныйМониторинг=2,КонецДня(Период),Период));
		Запрос.УстановитьПараметр("Ссылка", СписокЗаявок);
		
		Результат = Запрос.Выполнить();
		ТабличныйДокумент = Новый ТабличныйДокумент;
		Макет = Обработки.фин_КонтрольПрогнозныхТранзакций.ПолучитьМакет("РасшифровкаПоЗаявкам");
		ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
		ОбластьШапка.Параметры.ТекстСумма = "Сумма, "+Строка(Валюта);
		ТабличныйДокумент.Вывести(ОбластьШапка);
		ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
		ВыборкаДетальныеЗаписи = Результат.Выгрузить();
		ВыборкаДетальныеЗаписи.Колонки.Добавить("Разрезы",Новый ОписаниеТипов("Строка"));
		
		Для Каждого СтрокаЗаявка Из ВыборкаДетальныеЗаписи Цикл
            СтрокаЗаявка.Сумма = СтрокаЗаявка.СуммаЗаявки;
			Заявка = СтрокаЗаявка.Заявка;
			Для Каждого СтрокаПараметров Из Объект.СписокРазрезовКонтроля Цикл
				СтрокаЗаявка.Разрезы = СтрокаЗаявка.Разрезы+?(СтрокаЗаявка.Разрезы="","",";"+Символы.ПС)+фин_РаботаСДополнительнымиРазрезамиБюджетирования.ПредставлениеРазреза(Перечисления.фин_ФактическиеПоказателиБюджетирования[СтрокаПараметров.Значение])+": "+?(ЗначениеЗаполнено(СтрокаКонтроля[СтрокаПараметров.Значение]),Строка(СтрокаКонтроля[СтрокаПараметров.Значение]),"<пустое значение>");
			КонецЦикла;
			ОбластьСтрока.Параметры.Заполнить(СтрокаЗаявка);
			ТабличныйДокумент.Вывести(ОбластьСтрока);
		КонецЦикла;
		ТабличныйДокумент.ОтображатьСетку = Ложь;
		Возврат ТабличныйДокумент;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции
